//
// Created by Luo Wei on 2017/4/25.
// Copyright (c) 2017 luowei. All rights reserved.
//

#import "LWEncryptService.h"

static NSDictionary *endictionary = nil;
static NSDictionary *dedictionary = nil;
static NSString *divStr = @"\006\006\006";

@implementation LWEncryptService {

}

+ (void)load {
    [super load];

    endictionary = @{@" ": @"\007\007\007",
            @"!": @"\007\007\001",
            @"\"": @"\007\007\002",
            @"#": @"\007\007\003",
            @"$": @"\007\007\004",
            @"%": @"\007\007\005",
            @"&": @"\007\007\006",
            @"'": @"\007\001\007",
            @"(": @"\007\001\001",
            @")": @"\007\001\002",
            @"*": @"\007\001\003",
            @"+": @"\007\001\004",
            @",": @"\007\001\005",
            @"-": @"\007\001\006",
            @".": @"\007\002\007",
            @"/": @"\007\002\001",
            @"0": @"\007\002\002",
            @"1": @"\007\002\003",
            @"2": @"\007\002\004",
            @"3": @"\007\002\005",
            @"4": @"\007\002\006",
            @"5": @"\007\003\007",
            @"6": @"\007\003\001",
            @"7": @"\007\003\002",
            @"8": @"\007\003\003",
            @"9": @"\007\003\004",
            @":": @"\007\003\005",
            @";": @"\007\003\006",
            @"<": @"\007\004\007",
            @"=": @"\007\004\001",
            @">": @"\007\004\002",
            @"?": @"\007\004\003",
            @"@": @"\007\004\004",
            @"A": @"\007\004\005",
            @"B": @"\007\004\006",
            @"C": @"\007\005\007",
            @"D": @"\007\005\001",
            @"E": @"\007\005\002",
            @"F": @"\007\005\003",
            @"G": @"\007\005\004",
            @"H": @"\007\005\005",
            @"I": @"\007\005\006",
            @"J": @"\007\006\007",
            @"K": @"\007\006\001",
            @"L": @"\007\006\002",
            @"M": @"\007\006\003",
            @"N": @"\007\006\004",
            @"O": @"\007\006\005",
            @"P": @"\007\006\006",
            @"Q": @"\001\007\007",
            @"R": @"\001\007\001",
            @"S": @"\001\007\002",
            @"T": @"\001\007\003",
            @"U": @"\001\007\004",
            @"V": @"\001\007\005",
            @"W": @"\001\007\006",
            @"X": @"\001\001\007",
            @"Y": @"\001\001\001",
            @"Z": @"\001\001\002",
            @"[": @"\001\001\003",
            @"\\": @"\001\001\004",
            @"]": @"\001\001\005",
            @"^": @"\001\001\006",
            @"_": @"\001\002\007",
            @"`": @"\001\002\001",
            @"a": @"\001\002\002",
            @"b": @"\001\002\003",
            @"c": @"\001\002\004",
            @"d": @"\001\002\005",
            @"e": @"\001\002\006",
            @"f": @"\001\003\007",
            @"g": @"\001\003\001",
            @"h": @"\001\003\002",
            @"i": @"\001\003\003",
            @"j": @"\001\003\004",
            @"k": @"\001\003\005",
            @"l": @"\001\003\006",
            @"m": @"\001\004\007",
            @"n": @"\001\004\001",
            @"o": @"\001\004\002",
            @"p": @"\001\004\003",
            @"q": @"\001\004\004",
            @"r": @"\001\004\005",
            @"s": @"\001\004\006",
            @"t": @"\001\005\007",
            @"u": @"\001\005\001",
            @"v": @"\001\005\002",
            @"w": @"\001\005\003",
            @"x": @"\001\005\004",
            @"y": @"\001\005\005",
            @"z": @"\001\005\006",
            @"{": @"\001\006\007",
            @"|": @"\001\006\001",
            @"}": @"\001\006\002",
            @"~": @"\001\006\003",
            @"": @"\001\006\004",
            @"\r": @"\001\006\005",
            @"\n": @"\001\006\006"
    };

    NSMutableDictionary *dictionary = [NSMutableDictionary dictionary];
    for (NSString *key in endictionary) {
        dictionary[endictionary[key]] = key;
    }
    dedictionary = dictionary;
}

+ (BOOL)isEncryptString:(NSString *)str {
    if (!str) {
        return NO;
    }
    NSRange range = [str rangeOfString:divStr];
    return range.location != NSNotFound;
}

+ (NSString *)encryptText:(NSString *)primevalText displayText:(NSString *)displayText {
    if (!primevalText) {
        return nil;
    }

    if (primevalText.length == 0) {
        return @"";
    }

    NSData *data = [primevalText dataUsingEncoding:NSUTF8StringEncoding];
    NSString *base64 = [data base64EncodedStringWithOptions:NSDataBase64Encoding64CharacterLineLength];

    NSMutableString *retStr = [NSMutableString string];
    for (NSUInteger index = 0; index < base64.length; index++) {
        NSString *str = [base64 substringWithRange:NSMakeRange(index, 1)];
        [retStr appendString:endictionary[str]];
    }
    [retStr appendString:divStr];
    [retStr appendString:displayText];

    return retStr;
}

+ (NSString *)decryptText:(NSString *)imitativeText {
    if (!imitativeText) {
        return nil;
    }

    NSMutableString *input = [imitativeText mutableCopy];
    NSRange range = [input rangeOfString:divStr options:NSBackwardsSearch];
    if (range.location == NSNotFound) {
        return imitativeText;
    }
    [input deleteCharactersInRange:NSMakeRange(range.location, input.length - range.location)];
    if (input.length == 0) {
        return @"";
    }

    NSMutableString *base64 = [NSMutableString string];
    int idx = 0;
    while (idx < input.length) {
        NSString *string = [input substringWithRange:NSMakeRange(idx, 3)];
        NSString *refStr = dedictionary[string];
        [base64 appendString:refStr];
        idx+=3;
    }

    NSData *data = [[NSData alloc] initWithBase64EncodedString:base64 options:NSDataBase64DecodingIgnoreUnknownCharacters];
    NSString *text = [[NSString alloc] initWithData:data encoding:NSUTF8StringEncoding];

    return text;
}

+ (void)saveEncryptMode:(EncryptMode)encryptMode {
    [[NSUserDefaults standardUserDefaults] setInteger:encryptMode forKey:@"EncryptMode"];
    [[NSUserDefaults standardUserDefaults] synchronize];
}

+ (EncryptMode)getEncryptMode {
    EncryptMode encryptMode = (EncryptMode) [[NSUserDefaults standardUserDefaults] integerForKey:@"EncryptMode"];
    return encryptMode;
}


+ (NSArray *)getShortcut {
    return @[
            @"惟贤惟德，仁服于人。",
            @"蜀将何在？！",
            @"尔等敢应战否？？",
            @"难道这就是桃园吗……",
            @"观尔乃插标卖首。",
            @"关羽在此，尔等受死。",
            @"什么？此地叫麦城？",
            @"燕人张飞在此！！！",
            @"全军突击~~ ",
            @"能进能退乃真正法器",
            @"吾乃常山赵子龙也！",
            @"难道这就是失败的滋味吗？",
            @"观今夜天象，知天下大事！",
            @"知天易，逆天难！",
            @"将星陨落，天命难违",
            @"百步穿杨！",
            @"不得不服老啊~~",
            @"燃烧吧！",
            @"此火可助我军大获全胜！",
            @"你可识得此阵？",
            @"太极生两仪，两仪生四象，四象生八卦。",
            @"雕虫小计！",
            @"你的计谋被识破了！",
            @"我的计谋竟被……",
            @"伤一敌可连其百！",
            @"通通连起来吧",
            @"凤雏岂能消亡？",
            @"浴火重生！",
            @"看来我命中注定将丧命于此……",
            @"我会怕你吗？！",
            @"真是美味啊！",
            @"谁敢杀我，啊……",
            @"滴水之恩，涌泉以报！",
            @"睚眦之怨，无不报复。",
            @"给你的，十倍奉还给我！",
            @"重用许靖，以眩远近。",
            @"辅翼既折，蜀汉衰矣…",
            @"吾通晓兵法，世人皆知",
            @"丞相视某如子，某以丞相为父。",
            @"谡愿以死安大局。",
            @"魏将何在？",
            @"来人，护驾~ ",
            @"宁教我负天下人，休教天下人负我！",
            @"孤好梦中杀人！",
            @"霸业未成…未成啊…",
            @"孤善于千里袭人！",
            @"取汝首级犹如探囊取物！",
            @"竟然……比我……还快~ ",
            @"我先休息一会！",
            @"尽管来吧！",
            @"实在是守不住了！",
            @"下次注意点！",
            @"出来混，早晚要还的！",
            @"天命？哈哈哈哈～",
            @"吾乃天命之子！",
            @"难道真的是天命难违？",
            @"就这样吧~ 罢了",
            @"咳、咳~~~~",
            @"谁来和我大战300回合！",
            @"冷~好冷啊~~",
            @"鼠辈，竟然伤我！",
            @"以彼之道，还施彼身！",
            @"两，两边都看不见啦~",
            @"仿佛兮若轻云之蔽月，飘飘兮若流风之回雪",
            @"凌波微步，罗袜生尘",
            @"体恤飞服，飘忽若神",
            @"悼良会之永绝兮，哀一逝而异乡",
            @"此乃驱虎吞狼之计！",
            @"借你之手与他一搏吧！",
            @"秉忠贞之志，守谦退之节……",
            @"我…永不背弃 ",
            @"主公要臣死，臣不得不死……",
            @"吃我一戟！",
            @"主公，快走……",
            @"来来，一人一口",
            @"食之无肉，弃之有味。",
            @"不先为备，何以待敌?",
            @"稳重行军，百战不殆! ",
            @"我...无颜面对丞相了",
            @"别着急哟，给我就好~",
            @"这些都是我的！",
            @"走马行酒醴，驱车布肉鱼。",
            @"置酒高殿上，亲交从我游。",
            @"本是同根生，相煎何太急…",
            @"你的死活与我何干？",
            @"无来无去，不悔不怨。",
            @"无情者伤人，有情者自伤",
            @"自损八百，可伤敌一千",
            @"怎能如此对我",
            @"容我三思",
            @"好舒服呀~~",
            @"有汝辅佐，甚好",
            @"父亲，大哥，仲谋愧矣！",
            @"挣扎吧，在血和暗的深渊里！",
            @"汝等给我看好了！",
            @"既生瑜，何生…",
            @"请鞭笞我吧，公瑾！",
            @"赴汤蹈火，在所不辞！",
            @"失血过多了",
            @"牌不是万能的，但是没牌是万万不能的。",
            @"旧的不去，新的不来~",
            @"我还是太年轻了！",
            @"夫君，身体要紧~ ",
            @"他好我也好",
            @"请休息吧~ ",
            @"不是不报，时候未到！",
            @"留得青山在，不怕没柴烧！",
            @"被看穿了吗……",
            @"20年后,又是一条好汉！",
            @"替我挡着！",
            @"公瑾，我先走一步了~",
            @"我绝不会倒下！",
            @"我当要替天行道！",
            @"请助我一臂之力！",
            @"大丈夫当带三尺之剑，立不世之功……",
            @"伤敌于千里之外。索命于须臾之间。",
            @"大丈夫不惧死亡",
            @"吾乃吴国之母，何人敢造次？",
            @"有老身在，汝等尽可放心。",
            @"此真乃吾之佳婿。",
            @"男婚女嫁，须当交换文定之物。",
            @"大军在此！汝等休想前进一步！",
            @"盛不能奋身出命，不亦辱乎…",
            @"以我之真气，合天地之造化！",
            @"雷公助我！",
            @"天下大事，为我所控！",
            @"黄天……也死了! ",
            @"越老越要补啊！",
            @"早睡早起，方能养生！",
            @"别紧张，有老夫呢~",
            @"救人一命，胜造七级浮屠~ ",
            @"医者不能自医啊…",
            @"谁能挡我？！",
            @"神挡杀神，佛挡杀佛！",
            @"夫君，你要替妾身做主啊~~",
            @"失礼啦~~ ",
            @"父亲大人，对不起！",
            @"我要杀你们个片甲不留！",
            @"四面都是水……我命休矣……",
            @"弓箭手准备，放箭！",
            @"老天不助我袁家",
            @"这红脸长须大将是…… ",
            @"大汉天下，已半入我手！",
            @"玉玺在手，天下我有！",
            @"可恶…就差…一步了…",
            @"哎！我是不是该减肥了？",
            @"顺我者昌，逆我者亡！",
            @"汉室衰落~非我一人之罪~",
            @"给我翻过来！",
            @"死罪可免，活罪难赦！",
            @"我的是我的！你的~还是我的！",
            @"来~管杀还管埋",
            @"仙福永享~寿与天齐！",
            @"千秋万载~一统江山！",
            @"人是铁，饭是钢",
            @"截其源，断其粮，贼可擒也！",
            @"一顿不吃~饿的慌~",
            @"拿去拿去，莫跟哥哥客气！",
            @"来来来，见面分一半",
            @"以和为贵，以和为贵。",
            @"合纵连横，方能以弱胜强。",
            @"此联盟一破，吴蜀休矣~",
            @"不诛此贼三族！则~吾死不瞑目！",
            @"以吾魂魄，保佑吾儿之基业",
            @"丞相助我~~",
            @"背黑锅我来，送死~你去！",
            @"七纵之恩，来世再报了！",
            @"小小把戏~ ",
            @"大王，看我的！",
            @"尝尝我飞刀的厉害！",
            @"亮兵器吧~ ",
            @"大王~我~先走一步了",
            @"你奈我何？",
            @"此计伤不到我！",
            @"哭喊吧！哀求吧！挣扎吧！然后死吧！",
            @"呵呵呵~坐山观虎斗",
            @"我要你三更死，谁敢留你到五更！",
            @"神仙难救！神仙难救啊！",
            @"我的时辰~~也到了",
            @"众将听令！摆好阵势，御敌！",
            @"我军将败，我亦无颜苟活于世",
            @"如此，霸业可图也~ ",
            @"如此，一击可擒也！",
            @"如今之计，唯有退守，再做决断！",
            @"避嫌远疑，所以无误。",
            @"贬酒阙色，所以无污。",
            @"攻无不克战无不胜！",
            @"破阵斩将，易如反掌！",
            @"生死有命… ",
            @"我看好你！",
            @"将军岂愿抓牌乎？",
            @"唉，一切尽在不言中",
            @"嘘，言多必失啊！",
            @"娘……孩儿不孝……向您……请罪……"
    ];
}
@end